# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

tap "buo/cask-upgrade"
tap "domt4/autoupdate"

tap "koekeishiya/formulae"

# Services
brew "skhd"
brew "yabai"
#apt i3

# Development tools
# Base
#apt autotools-dev
#apt pkg-config

# hstr
#apt libncursesw5-dev
#apt libreadline-dev

# neovim
#apt cmake
#apt gettext
#apt libtool
#apt libtool-bin

# cmus
#apt libpulse-dev
#apt libasound2-dev
#apt libroar-dev
#apt libao-dev
#apt libcdio-dev
#apt flac
#apt libopus-dev
#apt libvorbis-dev
#apt libmpcdec-dev
#apt wavpack
#apt libmad0-dev
#apt libavcodec-dev
#apt libfaad2
#apt libmp4v2-dev
#apt libmodplug-dev

# mosh
#apt debhelper
#apt protobuf-compiler
#apt libprotobuf-dev
#apt dh-autoreconf
#apt libutempter-dev
#apt zlib1g-dev
#apt libncurses5-dev
#apt libssl-dev
#apt locales

# Binaries
brew "bash" # Bash 4 #apt
brew "cmus" #make (for the latest version)
brew "coreutils" # Those that come with macOS are outdated
#apt curl
#apt dnsmasq
brew "git-lfs"
brew "git" #apt
brew "hstr" #make (arm arch not supported)
brew "httpie" #apt
brew "jq" #apt
brew "mosh" #make (for 24-bit color support)
brew "nano" #apt
brew "neovim" #make (required for autocompletion to properly working)
#apt nodejs # required for coc.vim
#apt npm # required for coc.vim
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "q"
brew "reattach-to-user-namespace" # tmux-yank dependencies
brew "ripgrep" # (a better grep) fzf.vim dependencies #apt
brew "rsync" #apt
#apt screen
brew "tig" #apt
brew "tmux" #apt
brew "trash"
brew "wget" #apt
#apt xsel # tmux-yank dependencies
brew "youtube-dl"
#apt zsh

# Apps
cask "1password"
cask "4k-video-downloader"
cask "bartender"
cask "docker" #make (no package manager)
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "kaleidoscope"
cask "sourcetree"
cask "tableplus"
cask "ubersicht"
cask "visual-studio-code"
cask "vlc"

# Quicklook
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

# Fonts
cask "font-cascadia"
cask "font-fira-code"
cask "font-hasklig"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-menlo-for-powerline"
cask "font-meslo-for-powerline"
