# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

tap "buo/cask-upgrade"
tap "domt4/autoupdate"

# for sc-im
tap "nickolasburr/pfa"

#apt i3
#apt xserver-xorg
#apt xinit

# Development tools
# Base
#apt autotools-dev
#apt pkg-config

# hstr
#apt libncursesw5-dev
#apt libreadline-dev

# neovim
#apt cmake
#apt gettext
#apt libtool
#apt libtool-bin

# mosh
#apt debhelper
#apt protobuf-compiler
#apt libprotobuf-dev
#apt dh-autoreconf
#apt libutempter-dev
#apt zlib1g-dev
#apt libncurses5-dev
#apt libssl-dev
#apt locales

# sc-im
#apt bison
#apt libxml2-dev
#apt libzip-dev

# Binaries
brew "bash" # Bash 4 #apt
brew "coreutils" # Those that come with macOS are outdated
#apt curl
brew "diff-so-fancy"
#apt dnsmasq
brew "exa" #apt
brew "git-lfs"
brew "git" #apt
brew "git-flow" #apt
brew "gnupg2"
brew "hstr" #make (arm arch not supported)
brew "httpie" #apt
brew "jq" #apt
brew "lua@5.1" # sc-im dependencies
brew "mosh" #make (for 24-bit color support)
brew "mpd" #apt
brew "mycli" #apt
brew "nano" #apt
brew "ncmpcpp" #apt
brew "neofetch" #apt
brew "neovim" #make (required for autocompletion to properly working)
brew "netcat" #apt
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "q"
brew "reattach-to-user-namespace" # tmux-yank dependencies
brew "ripgrep" # (a better grep) fzf.vim dependencies #apt
brew "rsync" #apt
brew "sc-im" #make
brew "tig" #apt
brew "tmux" #apt
brew "trash"
brew "wget" #apt
#apt xsel # tmux-yank dependencies
brew "youtube-dl"
brew "cjbassi/ytop/ytop"
#apt ytop
#apt zsh

# Apps
cask "1password"
cask "4k-video-downloader"
cask "alacritty"
cask "bartender"
cask "docker-edge"
#make "docker" # no package manager
cask "flux"
cask "google-chrome"
cask "kaleidoscope"
cask "tableplus"
cask "vlc"

# Quicklook
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

# Fonts
# Use nerd-fonts instead
# cask "font-cascadia"
# cask "font-fira-code"
# cask "font-hasklig"
# cask "font-iosevka"
# cask "font-jetbrains-mono"
# cask "font-menlo-for-powerline"
# cask "font-meslo-for-powerline"
