# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

tap "buo/cask-upgrade"
tap "domt4/autoupdate"

# for sc-im
tap "nickolasburr/pfa"

# Development tools
# Base
#deb autotools-dev
#deb ca-certificates
#alpine build-base
#deb pkg-config
#alpine pkgconfig
#deb debhelper
#alpine automake

# hstr
#deb libncursesw5-dev
#deb libreadline-dev

# neovim
#deb cmake #alpine
#deb gettext #alpine
#deb libtool #alpine
#deb libtool-bin
#alpine openssl
#deb unzip
#alpine unzip
#alpine musl-libintl

# mosh
#deb g++
#alpine perl-doc
#deb protobuf-compiler
#alpine protoc
#deb libprotobuf-dev
#alpine protobuf-dev
#deb dh-autoreconf
#alpine autoconf
#deb libutempter-dev
#alpine libutempter
#deb zlib1g-dev
#alpine zlib-dev
#deb libncurses5-dev
#alpine ncurses-dev
#alpine ncurses-libs
#deb libssl-dev
#alpine libressl-dev
#deb locales

# sc-im
#deb bison #alpine
#deb libxml2-dev #alpine
#deb libzip-dev #alpine

# tmux
#deb libevent-dev

# Binaries
brew "bash" # Bash 4 #deb #alpine
brew "bat" # cat replacement
brew "coreutils" # Those that come with macOS are outdated
brew "csvkit" #deb
#deb curl #alpine
#deb dnsmasq #alpine
brew "exa" #deb #alpine
brew "gh" # for linux, see https://github.com/cli/cli/blob/trunk/docs/install_linux.md
brew "git" #deb #alpine
brew "git-delta"
brew "git-flow" #deb #community-alpine
brew "git-lfs"
brew "gomplate"
brew "gnupg2"
brew "hstr" #make (arm arch not supported) #alpine
brew "httpie" #deb #alpine
brew "jq" #deb #alpine
brew "lua@5.1" # sc-im dependencies
#dev mdp # presentation tool
brew "mosh" #make (for 24-bit color support)
brew "mpd" #deb #community-alpine
brew "mycli" #deb #testing-alpine
brew "nano" #deb #alpine
#edge-alpine boost-dev # ncmpcpp dependencies
brew "ncmpcpp" #deb #testing-alpine
brew "neovim", args: ["HEAD"] #make (required for autocompletion to properly working)
brew "neomutt" # use Docker for the rest
brew "netcat" #deb
#alpine netcat-openbsd
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "q"
brew "reattach-to-user-namespace" # tmux-yank dependencies
brew "ripgrep" # (a better grep) fzf.vim dependencies #deb #community-alpine
brew "rsync" #deb #alpine
brew "sc-im" #make
#deb sysstat
brew "tig" #deb #alpine
brew "tmux" #make # tmux on arm is still outdated
brew "trash"
brew "w3m" #deb # TUI web browser (neomutt integrated)
brew "wget" #deb #alpine
#deb xsel # tmux-yank dependencies
brew "cjbassi/ytop/ytop"
# ytop  -- not available on apt
#deb zsh

# Apps
cask "1password"
cask "4k-video-downloader"
cask "alacritty"
cask "alfred"
cask "bartender"
cask "commandq"
cask "docker-edge"
#make "docker" # no package manager
cask "flux" # blue light reducer
cask "google-chrome"
cask "kaleidoscope"
cask "lunar" # screen brightness / contrast sync
cask "notion"
cask "tableplus"
cask "vlc"

# Quicklook
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

#dpkg https://github.com/sharkdp/bat/releases/download/v0.15.4/bat_0.15.4_armhf.deb
#dpkg https://github.com/dandavison/delta/releases/download/0.4.1/git-delta_0.4.1_armhf.deb

#binary https://raw.githubusercontent.com/dylanaraps/pfetch/master/pfetch pfetch
#binary https://github.com/hairyhenderson/gomplate/releases/download/v3.8.0/gomplate_linux-armv7-slim gomplate

# Fonts
# Use nerd-fonts instead
# cask "font-cascadia"
# cask "font-fira-code"
# cask "font-hasklig"
# cask "font-iosevka"
# cask "font-jetbrains-mono"
# cask "font-menlo-for-powerline"
# cask "font-meslo-for-powerline"
